app/controllers/tasks_controller.rb

  def index
    @tasks = Task.where(status: 'incomplete')
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = ?  [["status", "incomplete"]]

  def create
    @task = Task.new(task_params)
    @task.status = 'incomplete'
    if @task.save
---
INSERT INTO "tasks" ("name", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "s"], ["status", "incomplete"], ["created_at", "2024-10-10 17:14:10.649118"], ["updated_at", "2024-10-10 17:14:10.649118"]]

  def complete
    @task = Task.find(params[:id])
    if @task.update(status: 'complete')
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "complete"], ["updated_at", "2024-10-10 17:14:18.275644"], ["id", 1]]

  def completed
    @completed_tasks = Task.where(status: 'complete')
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = ?  [["status", "complete"]]